# Დაწერეთ პროგრამა რომელიც მიიღებს true ან false. Თუ პროგრამამ მიიღო true, ეკრანზე დაბეჭდეთ “whoala”.

# Დაწერეთ პროგრამა რომელიც მიიღებს ორ რიცხვს, დაადგენს პირველი რიცხვი არის თუ არა მეორე რიცხვის ჯერადი და დაბეჭდავს ეკრანზე. A რიცხვს ეწოდება B რიცხვის ჯერადი, თუ A = B * n,  სადაც n ნატურალური რიცხვია.

# Დაწერეთ პროგრამა რომელიც მიიღებს მთელ რიცხვს. Პროგრამამ უნდა დაბეჭდოს ყველა ყველა მარტივი გამყოფი ერთ ხაზზე. Შემოსული რიცხვის მაქსიმალური მნიშვნელობა უნდა იყოს 10. Მაგალითი: თუ პროგრამას გადავეცით 6,
# გამოსავალზე უნდა დაიბეჭდოს 2, 3. ახსნა: 6 იყოფა 2-ზეც და 3-ზეც. 2 და 3 არის მარტივი რიცხვები. Დაიცავით პროგრამა ისეთი არგუმენტებისგან, რომლებიც არ არის დასაშვები.

# Დაწერეთ პროგრამა რომელიც არგუმენტად მიიღებს მანქანის სიჩქარეს, განსაზღვრავს მისი სიჩქარის კატეგორიას და დაბეჭდავს ეკრანზე. Სიჩქარის კატეგორიები განისაზღვრება შემდეგნაირად. Თუ ავტომობილის სიჩქარე 30 კმ/სთ-ზე ნაკლებია,
# მისი კატეგორიაა - SLOW. Როცა ავტომობილის სიჩქარე  120 კმ/სთ-ზე მეტია, მისი კატეგორიაა - VERY FAST. Თუ ავტომობილის სიჩქარე მეტია 60 კმ/სთ-ზე, მისი კატეგორიაა - FAST. Ხოლო თუ ავტომობილის სიჩქარე მეტია 30 კმ/სთ-ზე,
# მისი კატეგორიაა - MODERATE. (თუ ავტომობლი ხვდება ორ კატეგორაიში, უნდა შეირჩეს უფრო სწრაფი კატეგორია)