
# Დაწერეთ პროგრამა რომელიც არგუმენტად მიიღებს მანქანის სიჩქარეს, განსაზღვრავს მისი სიჩქარის კატეგორიას და დაბეჭდავს ეკრანზე. Სიჩქარის კატეგორიები განისაზღვრება შემდეგნაირად. Თუ ავტომობილის სიჩქარე 30 კმ/სთ-ზე ნაკლებია,
# მისი კატეგორიაა - SLOW. Როცა ავტომობილის სიჩქარე  120 კმ/სთ-ზე მეტია, მისი კატეგორიაა - VERY FAST. Თუ ავტომობილის სიჩქარე მეტია 60 კმ/სთ-ზე, მისი კატეგორიაა - FAST. Ხოლო თუ ავტომობილის სიჩქარე მეტია 30 კმ/სთ-ზე,
# მისი კატეგორიაა - MODERATE. (თუ ავტომობლი ხვდება ორ კატეგორაიში, უნდა შეირჩეს უფრო სწრაფი კატეგორია)

car_speed = float(input("Enter car speed: "))

if car_speed > 120:
    print("VERY FAST")
elif car_speed > 60:
    print("FAST")
elif car_speed > 30:
    print("MODERATE")
elif car_speed >= 0:
    print("SLOW")
else:
    print("Car speed can't be lower than 0")
