import math
import random

# 2. დაწერეთ პროგრამა რომელიც მიიღებს ნატურალურ რიცხვს n. n > 1.
# პროგრამამ უნდა დააგენერიროს n ცალი წყვილი შემთხვევითი რიცხვი a,b, სადაც 0<a<1 და 0<b<1.

n = 10000000
counter = 0

if not (n > 1):
    print("Incorrect input ")
    exit(1)

for i in range(0, n):
    a = random.random()
    b = random.random()
    if math.sqrt(a ** 2 + b ** 2) <= 1:
        counter += 1

print(4 * counter / n)

# 10       - 2.4 - 3.6
# 100      - 2.8 - 3.4
# 100000   - 3.13 - 3.14
# 10000000 - 3.14 - 3.14

# რაც უფრო მაღალია n მით უფრო ნაკლებია range (4 * counter / n) ის მიერ დაბეჭდილ რიცხვებს შორის.
# ჩემი აზრით ეს ფუნქცია გამოიყენება მიახლოებული math.pi რიცხვის მისაღებად.
# რაც უფრო მაღალია n მით უფრო ახლოს ვიქნებით pi - თან
