# 1. დაწერეთ პროგრამა რომელიც მიიღებს ნატურალურ რიცხვს n. n > 1. პროგრამამ უნდა დაითვალის რიცხვი x და დაბეჭდოს ეკრანზე.

n = int(input("Enter number: "))

if not (n > 1):
    print("Incorrect input ")
    exit(1)

step = 1
x = 0

while step <= n:
    next_value = 1 / ((2 * step) - 1)
    if step % 2 == 0:
        next_value *= -1
    x += next_value
    step += 1

print(x * 4)

# 10      - 3.0418396189294032
# 100     - 3.1315929035585537
# 1000    - 3.140592653839794
# 10000   - 3.1414926535900345
# 100000  - 3.1415826535897198

# რაც უფრო მაღალია n მით უფრო ნაკლებია სხვაობა, ეს გამოწვეულია იმით რომ
# 1 / (2n-1) უფრო და უფრო პატარავდება step - ის მატებასთან ერთად.
# x - ის დადებითობა გამოწვეულია პირველი ელემენტით.
